apps/haderos-web/stress-test.yml

config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 100
      name: Warm up
    - duration: 120
      arrivalRate: 500
      name: Ramp up
    - duration: 300
      arrivalRate: 2000
      name: Stress test
    - duration: 60
      arrivalRate: 100
      name: Cool down
  plugins:
    ensure: {}
    metrics-by-endpoint: {}
  ensure:
    thresholds:
      - http.response_time.p99: 5000
      - http.response_time.median: 2000
scenarios:
  - name: "Create Orders Stress"
    flow:
      - post:
          url: "/api/trpc/orders.createOrder"
          json:
            customerName: "Stress User"
            customerPhone: "01099887766"
            shippingAddress: "Giza, Egypt"
            items:
               - productName: "Stress Item"
                 quantity: 1
                 price: 100
            totalAmount: 100
          capture:
            json: "$.result.data.orderId"
            as: "orderId"
      - think: 1